

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
		
	
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоГруппаШапка(Форма); 
		ДобавитьСогласованнаяСкидкаИКомандаПересчет(Форма);
		
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоГруппаШапка(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоГруппаШапка(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоПередДоговором(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоПередДоговором(Форма);
	КонецЕсли;
	
	
КонецПроцедуры	


Процедура ДобавитьСогласованнаяСкидкаИКомандаПересчет(Форма)
	ДобавляемыеРеквизиты = Новый Массив;
	РеквизитКонтактноеЛицо = Новый РеквизитФормы("СогласованнаяСкидка",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(100,0)));
	
	ДобавляемыеРеквизиты.Добавить(РеквизитКонтактноеЛицо);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка",Тип("ПолеФормы") , Форма.Элементы.ГруппаШапкаЛево);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении" ,"СогласованнаяСкидкаПриИзминении" );
		
	Команда = Форма.Команды.Добавить("ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать Таблицу";
	Команда.Действие = "КомандаПересчитатьТаблицу";
	
	КнопкаФормы = Форма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	КнопкаФормы.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры	
	
	

	
	Процедура ДобавитьКонтактноеЛицоГруппаШапка(Форма)
		
		
		
		ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
		
	КонецПроцедуры
	
	Процедура ДобавитьКонтактноеЛицоПередДоговором(Форма)
		

		ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
		
	КонецПроцедуры
